<?php

return array (
  'accepted' => 'แอตทริบิวต์: ต้องถูกยอมรับ',
  'active_url' => 'แอตทริบิวต์: ไม่ใช่ URL ที่ถูกต้อง',
  'after' => 'แอตทริบิวต์: ต้องเป็นวันที่หลังจาก: วันที่',
  'after_or_equal' => 'แอตทริบิวต์: ต้องเป็นวันที่หลังหรือเท่ากับ: วันที่',
  'alpha' => 'แอตทริบิวต์: ต้องประกอบด้วยตัวอักษรเท่านั้น',
  'alpha_dash' => 'แอตทริบิวต์: ต้องประกอบด้วยตัวอักษรตัวเลขขีดกลางและขีดล่างเท่านั้น',
  'alpha_num' => 'แอตทริบิวต์: ต้องประกอบด้วยตัวอักษรและตัวเลขเท่านั้น',
  'array' => 'แอตทริบิวต์: ต้องเป็นอาร์เรย์',
  'before' => 'แอตทริบิวต์: ต้องเป็นวันที่ก่อน: วันที่',
  'before_or_equal' => 'แอตทริบิวต์: ต้องเป็นวันที่ก่อนหรือเท่ากับวันที่',
  'between' =>
  array (
    'numeric' => 'แอตทริบิวต์: ต้องอยู่ระหว่าง: น้อยกว่า และ: มากกว่า',
    'file' => 'แอตทริบิวต์: ต้องอยู่ระหว่าง: น้อยกว่า และ: มากกว่า กิโลไบต์',
    'string' => 'แอตทริบิวต์: ต้องอยู่ระหว่างอักขระ น้อยกว่า และ: มากกว่า',
    'array' => 'แอตทริบิวต์: ต้องมีรายการระหว่าง: น้อยกว่า และ: มากกว่า',
  ),
  'boolean' => 'ช่องแอตทริบิวต์ต้องเป็นจริงหรือเท็จ',
  'confirmed' => 'การยืนยันแอตทริบิวต์ไม่ตรงกัน',
  'date' => 'แอตทริบิวต์: ไม่ใช่วันที่ที่ถูกต้อง',
  'date_equals' => 'แอตทริบิวต์: ต้องเป็นวันที่เท่ากับวันที่',
  'date_format' => 'แอตทริบิวต์: ไม่ตรงกับรูปแบบของ: รูปแบบ',
  'different' => 'แอตทริบิวต์และ: อื่นๆ ต้องแตกต่างกัน',
  'digits' => 'แอตทริบิวต์: ต้องเป็นตัวเลขหลัก',
  'digits_between' => 'แอตทริบิวต์: ต้องอยู่ระหว่าง: น้อยกว่า และ: มากกว่า',
  'dimensions' => 'แอตทริบิวต์: มีขนาดรูปภาพที่ไม่ถูกต้อง',
  'distinct' => 'ฟิลด์แอตทริบิวต์: มีค่าที่ซ้ำกัน',
  'email' => 'แอตทริบิวต์: ต้องเป็นที่อยู่อีเมลที่ถูกต้อง',
  'ends_with' => 'แอตทริบิวต์: ต้องลงท้ายด้วยอย่างใดอย่างหนึ่งต่อไปนี้: ค่า',
  'exists' => 'แอตทริบิวต์ที่เลือก: ไม่ถูกต้อง',
  'file' => 'แอตทริบิวต์: ต้องเป็นไฟล์',
  'filled' => 'ฟิลด์แอตทริบิวต์: ต้องมีค่า',
  'gt' =>
  array (
    'numeric' => 'แอตทริบิวต์: ต้องมากกว่า: ค่า',
    'file' => 'แอตทริบิวต์: ต้องมากกว่า: ค่ากิโลไบต์',
    'string' => 'แอตทริบิวต์: ต้องมากกว่า: ค่าอักขระ',
    'array' => 'แอตทริบิวต์: ต้องมีรายการมากกว่า: ค่า',
  ),
  'gte' =>
  array (
    'numeric' => 'แอตทริบิวต์: ต้องมากกว่าหรือเท่ากับ: ค่า',
    'file' => 'แอตทริบิวต์: ต้องมากกว่าหรือเท่ากับ: ค่าของกิโลไบต์',
    'string' => 'แอตทริบิวต์: ต้องมากกว่าหรือเท่ากับค่าอักขระ',
    'array' => 'แอตทริบิวต์: ต้องมีรายการค่าหรือมากกว่า',
  ),
  'image' => 'แอตทริบิวต์: ต้องเป็นรูปภาพ',
  'in' => 'แอตทริบิวต์ที่เลือก: ไม่ถูกต้อง',
  'in_array' => 'ไม่มีฟิลด์แอตทริบิวต์: ที่มีอยู่ใน: อื่นๆ',
  'integer' => 'แอตทริบิวต์: ต้องเป็นจำนวนเต็ม',
  'ip' => 'แอตทริบิวต์: ต้องเป็นที่อยู่ IP ที่ถูกต้อง',
  'ipv4' => 'แอตทริบิวต์: ต้องเป็นที่อยู่ IPv4 ที่ถูกต้อง',
  'ipv6' => 'แอตทริบิวต์: ต้องเป็นที่อยู่ IP6 ที่ถูกต้อง',
  'json' => 'แอตทริบิวต์: ต้องเป็นสตริง JSON ที่ถูกต้อง',
  'lt' =>
  array (
    'numeric' => 'แอตทริบิวต์: ต้องน้อยกว่า: ค่า',
    'file' => 'แอตทริบิวต์: ต้องน้อยกว่า: ค่ากิโลไบต์',
    'string' => 'แอตทริบิวต์: ต้องมีอักขระน้อยกว่า: ค่า',
    'array' => 'แอตทริบิวต์: ต้องมีรายการน้อยกว่า: ค่า',
  ),
  'lte' =>
  array (
    'numeric' => 'แอตทริบิวต์: ต้องน้อยกว่าหรือเท่ากับ: ค่า',
    'file' => 'แอตทริบิวต์: ต้องน้อยกว่าหรือเท่ากับ: ค่าของกิโลไบต์',
    'string' => 'แอตทริบิวต์: ต้องมีอักขระน้อยกว่าหรือเท่ากับ: ค่า',
    'array' => 'แอตทริบิวต์: ต้องมีรายการไม่เกิน: ค่า',
  ),
  'max' =>
  array (
    'numeric' => 'แอตทริบิวต์: ต้องไม่มากกว่า: ค่ามากกว่า',
    'file' => 'แอตทริบิวต์: ต้องไม่เกิน: กิโลไบต์สูงสุด',
    'string' => 'แอตทริบิวต์: ต้องมีความยาวไม่เกิน: อักขระสูงสุด',
    'array' => 'แอตทริบิวต์: ต้องมีรายการไม่เกิน: สูงสุด',
  ),
  'mimes' => 'แอตทริบิวต์: ต้องเป็นไฟล์ประเภท: ค่า',
  'mimetypes' => 'แอตทริบิวต์: ต้องเป็นไฟล์ประเภท: ค่า',
  'min' =>
  array (
    'numeric' => 'แอตทริบิวต์: ต้องมีค่าอย่างน้อย: น้อยกว่า',
    'file' => 'แอตทริบิวต์: ต้องมีค่าอย่างน้อย: น้อยกว่ากิโลไบต์',
    'string' => 'แอตทริบิวต์: ต้องมีอักขระอย่างน้อย: น้อยกว่า',
    'array' => 'แอตทริบิวต์: ต้องมีรายการอย่างน้อย: ขั้นต่ำ',
  ),
  'not_in' => 'แอตทริบิวต์ที่เลือก: ไม่ถูกต้อง',
  'not_regex' => 'รูปแบบ: แอตทริบิวต์ไม่ถูกต้อง',
  'numeric' => 'แอตทริบิวต์: ต้องเป็นตัวเลข',
  'password' => 'รหัสผ่านไม่ถูกต้อง',
  'present' => 'ต้องมีฟิลด์แอตทริบิวต์: ในปัจจุบัน',
  'regex' => 'แอตทริบิวต์: มีรูปแบบไม่ถูกต้อง',
  'required' => 'แอตทริบิวต์: จำเป็นต้องระบุฟิลด์',
  'required_if' => 'แอตทริบิวต์: จำเป็นต้องใช้เมื่อ: อื่นๆ คือ: ค่า',
  'required_unless' => 'แอตทริบิวต์: จำเป็นต้องใช้อย่างน้อยเมื่อ :อื่นๆ อยู่ใน :ค่า',
  'required_with' => 'แอตทริบิวต์: จำเป็นต้องมีเมื่อ: ค่าแสดงอยู่',
  'required_with_all' => 'แอตทริบิวต์: จำเป็นต้องมีเมื่อ: ค่าจำนวนวมากแสดงอยู่',
  'required_without' => 'แอตทริบิวต์: จำเป็นต้องมีเมื่อ: ค่าไม่แสดงอยู่',
  'required_without_all' => 'แอตทริบิวต์: จำเป็นต้องมีเมื่อ: ค่าจำนวนวมากไม่แสดงอยู่',
  'same' => 'แอตทริบิวต์และ: อื่น ๆ ต้องตรงกัน',
  'size' =>
  array (
    'numeric' => 'แอตทริบิวต์ต้องเป็น: ขนาด',
    'file' => 'แอตทริบิวต์: ต้องเป็น: ขนาดกิโลไบต์',
    'string' => 'แอตทริบิวต์: ต้องเป็นอักขระขนาด',
    'array' => 'แอตทริบิวต์ต้องมี: รายการขนาด',
  ),
  'starts_with' => 'แอตทริบิวต์: ต้องขึ้นต้นด้วยค่าใดค่าหนึ่งต่อไปนี้:: ค่า',
  'string' => 'แอตทริบิวต์: ต้องเป็นสตริง',
  'timezone' => 'แอตทริบิวต์: ต้องเป็นโซนที่ถูกต้อง',
  'unique' => 'แอตทริบิวต์: ถูกนำมาใช้แล้ว',
  'uploaded' => 'แอตทริบิวต์: ไม่สามารถอัปโหลดได้',
  'url' => 'แอตทริบิวต์: ,uรูปแบบไม่ถูกต้อง',
  'uuid' => 'แอตทริบิวต์: ต้องเป็น UUID ที่ถูกต้อง',
  'custom' =>
  array (
    'attribute-name' =>
    array (
      'rule-name' => 'ข้อความที่กำหนดเอง',
    ),
  ),
);
